Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterMulti.DesignParIndex Enumeration
 Multi value design parameter indexes
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DesignParIndex
Public Enumeration DesignParIndex
Members
Member name | Value | Description
Ky | 88 |  VAM_DESIGNPARINDEX_MultiKy => 88.
Kz | 89 |  VAM_DESIGNPARINDEX_MultiKz => 89.
Ly | 90 |  VAM_DESIGNPARINDEX_MultiLy => 90.
Lz | 91 |  VAM_DESIGNPARINDEX_MultiLz => 91.
See Also
Reference
Tekla.Structures.Analysis Namespace